---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawWallsError
source: html/3fcc22d7-9550-2f14-f0d1-0df3789766d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawWallsError Property

Can't make Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawWallsError { get; }
```